micropython/micropython/ports/esp32/boards/BPI_LEAF_S3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "BPI-Leaf-S3"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3"

#define MICROPY_PY_MACHINE_DAC              (0)

#define MICROPY_HW_I2C0_SCL                 (16)
#define MICROPY_HW_I2C0_SDA                 (15)

#define MICROPY_HW_SPI1_MOSI                (35)
#define MICROPY_HW_SPI1_MISO                (37)
#define MICROPY_HW_SPI1_SCK                 (36)
